Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotJoinElements Property
 Can't keep elements joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotJoinElements { get; }
Public Shared ReadOnly Property CannotJoinElements As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotJoinElements {
	FailureDefinitionId^ get ();
}
static member CannotJoinElements : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace